// Ввести строку. Проверить является ли это число или строка. Если число, то
// выяснить, четное или нет. Если это строка то преобразовать строку в массив, где
// каждый символ – один элемент массива
// ‘hschool’ => [‘h’, ‘s’, ‘c’, ‘h’, ‘o’, ‘o’, ‘l’]
// let str = prompt('');
// if (!isNaN(str)) {
// // { if (str % 2 === 0){
// //     console.log('Четное');
// // }
// // else {
// //     console.log('Нечетное');

// // }
// // }
// str %2 ===0 ? console.log('Четное') ^ console.log('Нечетное')
// }else {
// console.log(split());
// }